//
//  Error.strings
//  TheBox iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "Felaktigt användarnamn eller lösenord";
"_cancelled_by_user"                    = "Överföring avbruten";
"_error_folder_destiny_is_the_same_"    = "Det är inte möjligt att flytta mappen till samma mapp.";
"_error_not_permission_"                = "Du har inte behörigheter att genomföra detta";
"_error_path_"                          = "Kan ej öppna denna fil eller mapp. Kontrollera att den existerar.";
"_file_upload_not_exitst_"              = "Filen du försöker ladda upp finns inte";
"_forbidden_characters_from_server_"    = "Namnet innehåller minst ett otillåtet tecken";
"_not_connected_internet_"              = "Anslutningsfel mot servern";
"_not_possible_connect_to_server_"      = "Det är inte möjligt att ansluta till servern för tillfället";
"_not_possible_create_folder_"          = "Mappen kunde inte skapas";
"_server_down_"                         = "Servern kan ej nås";
"_time_out_"                            = "Detta tog för lång tid, försök igen.";
"_unknow_response_server_"              = "Oväntat fel från servern";
"_user_autentication_required_"         = "Användarautentisering krävs";
"_file_directory_locked_"               = "Fil eller mapp är låst";
"_ssl_certificate_untrusted_"           = "Certifikatet för denna server är ogiltigt";
"_internal_server_"                     = "Internt Serverfel";

"_file_already_exists_"                 = "Kan ej genomföras, det finns redan en fil med samma namn";
"_file_folder_not_exists_"              = "Filen kunde inte hittas i den angivna sökvägen";
"_folder_contents_nochanged_"           = "Mappens innehåll har inte ändrats";
"_images_invalid_converted_"            = "Bilden är ogiltig och kan inte konverteras till en tumnagelbild";
"_method_not_expected_"                 = "Begäran ej förväntad";
"_reauthenticate_user_"                 = "Åtkomst har löpt ut, vänligen återautentisera användaren";
"_server_error_retry_"                  = "Servern är temporärt otillgänglig";
"_too_many_files_"                      = "För många filer är involverade i denna begäran för att det ska genomföras utan problem.";
"_too_many_request_"                    = "Taket för antalet anrop nåddes.";
"_user_over_quota_"                     = "Lagringsutrymmesgräns nådd";

"_ssl_connection_error_"                = "Problem med SSL-anslutningen, försök igen";
